import { useNavigate, useLocation } from "react-router-dom";
import headerLogo from "../assets/logo_school_text.svg";
import signoutlogo from "../assets/Exit.svg";
import { Link } from "react-router-dom";
import Swal from "sweetalert2";

// Helper function for SweetAlert and navigation
export const showSignOutAlert = (navigate) => {
  Swal.fire({
    title: "هل أنت متأكد؟",
    text: ".سوف يتم تحويلك الى صفحة الدخول",
    icon: "warning",
    showCancelButton: true,
    confirmButtonColor: "#3085d6",
    cancelButtonColor: "#d33",
    confirmButtonText: "نعم",
    cancelButtonText: "إلغاء",
  }).then((result) => {
    if (result.isConfirmed) {
      Swal.fire({
        text: ".سيتم تحويلك الى صفحة تسجيل الدخول",
        icon: "success",
        confirmButtonText: "حسنََا",
      }).then(() => {
        navigate("/loginPage");
      });
    }
  });
};

const SideNav = () => {
  const navigate = useNavigate();
  const location = useLocation(); // Get the current path

  const handleSignOut = () => {
    // Call the SweetAlert and navigation function
    showSignOutAlert(navigate);
  };
  // Conditionally apply hover and text styles based on the current location
  const isActive = (path) => location.pathname === path;
  return (
    <div className="top-0 right-0 w-65 h-full bg-white shadow-lg rounded-l-lg z-50 p-4 flex flex-col justify-between">
      <div>
        <div className="mb-10 mt-3">
          <img src={headerLogo} alt="Logo" className="mx-auto w-44 h-24" />
        </div>

        <ul className="space-y-4">
          {/* {لوحة القيادة} */}
          <li>
            <Link to="/HomePage" className="font-cairo font-medium">
              <button
                className={`w-full flex items-center justify-start px-4 h-14 rounded-[15px] ${
                  isActive("/HomePage")
                    ? "bg-[#3bc9d327] text-[#3BCAD3]"
                    : "hover:bg-[#3bc9d327] text-[#6A6A6A] hover:text-[#3BCAD3]"
                } group`}
              >
                <svg
                  className={`ml-7 mr-3 ${
                    isActive("/HomePage")
                      ? "fill-[#3BCAD3]"
                      : "fill-[#6A6A6A] group-hover:fill-[#3BCAD3]"
                  }`}
                  width="24"
                  height="24"
                  viewBox="0 0 44 40"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path d="M26.4 40V25.8824H17.6V40H6.6V21.1765H0L22 0L44 21.1765H37.4V40H26.4Z" />
                </svg>
                لوحة القيادة
                {/* <p className="font-cairo font-medium">لوحة القيادة</p> */}
              </button>
            </Link>
          </li>
          {/* {ادارة الطلاب} */}
          <li>
            <Link to="/StudentPage" className="font-cairo font-medium">
              <button
                className={`w-full flex items-center justify-start px-4 h-14 rounded-[15px] ${
                  isActive("/StudentPage")
                    ? "bg-[#3bc9d327] text-[#3BCAD3]"
                    : "hover:bg-[#3bc9d327] text-[#6A6A6A] hover:text-[#3BCAD3]"
                } group`}
              >
                <svg
                  className={`ml-7 mr-3 ${
                    isActive("/StudentPage")
                      ? "fill-[#3BCAD3]"
                      : "fill-[#6A6A6A] group-hover:fill-[#3BCAD3]"
                  }`}
                  width="30"
                  height="24"
                  viewBox="0 0 42 28"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path d="M21.1205 11.3343C18.7699 11.3343 16.7483 8.91181 16.7483 5.75707C16.7483 2.64056 18.781 0.331844 21.1205 0.331844C23.46 0.331844 25.4934 2.69152 25.4934 5.78255C25.4934 8.91181 23.4711 11.3343 21.1205 11.3343ZM33.7027 11.624C31.6693 11.624 29.8979 9.5047 29.8979 6.76703C29.8979 4.05399 31.6804 2.04767 33.7027 2.04767C35.7361 2.04767 37.5288 4.1041 37.5178 6.79166C37.5178 9.5047 35.7471 11.6248 33.7027 11.6248M8.53829 11.6248C6.49388 11.6248 4.72323 9.50555 4.72323 6.79251C4.72323 4.10495 6.50492 2.04852 8.53829 2.04852C10.5606 2.04852 12.3431 4.05484 12.3431 6.76703C12.3431 9.50555 10.5717 11.6248 8.53829 11.6248ZM39.8028 23.0181H31.4942C32.6312 21.1128 31.2432 17.2769 28.8927 15.1822C30.107 14.2487 31.6693 13.5547 33.713 13.5547C38.6445 13.5547 41.7266 17.7559 41.7266 21.2513C41.7266 22.387 41.1798 23.0181 39.8028 23.0181ZM2.43816 23.0181C1.0502 23.0181 0.514442 22.387 0.514442 21.2513C0.514442 17.7559 3.59726 13.5547 8.52726 13.5547C10.5717 13.5547 12.1348 14.2487 13.3476 15.1822C10.9978 17.2769 9.60907 21.1128 10.7461 23.0181H2.43816ZM27.997 23.0181H14.2557C12.5396 23.0181 11.9273 22.4498 11.9273 21.3396C11.9273 18.0847 15.4583 13.5929 21.1315 13.5929C26.7938 13.5929 30.3248 18.0847 30.3248 21.3396C30.3248 22.4498 29.7132 23.0181 27.997 23.0181Z" />
                  <ellipse
                    cx="5.83838"
                    cy="6.64941"
                    rx="5.83838"
                    ry="6.64941"
                    transform="matrix(-1 0 0 1 17.6875 14.4141)"
                  />
                  <path
                    d="M11.1711 17.6176C11.1711 17.1477 11.4739 16.7617 11.8474 16.7617C12.221 16.7617 12.526 17.1477 12.5237 17.6176V19.8187H14.2631C14.6345 19.8187 14.9395 20.2019 14.9395 20.6745C14.9395 21.1444 14.6345 21.5304 14.2631 21.5304H12.5237V23.7287C12.5237 24.1986 12.221 24.5846 11.8474 24.5846C11.4761 24.5846 11.1711 24.2014 11.1711 23.7287V21.5304H9.43394C9.06264 21.5304 8.75764 21.1472 8.75764 20.6745C8.75764 20.2047 9.06043 19.8187 9.43394 19.8187H11.1711V17.6176Z"
                    fill="white"
                  />
                </svg>
                إدارة الطلاب
                {/* <p className="font-cairo font-medium">ادارة الطلاب</p> */}
              </button>
            </Link>
          </li>
          {/* {الإعدادات} */}
          <li>
            <button className="w-full flex items-center justify-start px-4 h-14 rounded-[15px] hover:bg-[#3bc9d327] text-[#6A6A6A] hover:text-[#3BCAD3] group">
              <svg
                className="ml-7 mr-3 fill-[#6A6A6A] group-hover:fill-[#3BCAD3]"
                width="24"
                height="24"
                viewBox="0 0 44 44"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="M19.6284 4.01527e-06C18.9817 4.01527e-06 18.4031 0.402599 18.1853 1.00539L16.6321 5.31074C16.0756 5.44934 15.5982 5.58794 15.1934 5.73313C14.7512 5.89153 14.1814 6.13133 13.4774 6.45913L9.86077 4.54515C9.56556 4.38875 9.2276 4.33229 8.89758 4.38425C8.56757 4.43621 8.2633 4.59379 8.03043 4.83335L4.84934 8.12231C4.42696 8.5601 4.30816 9.20029 4.54575 9.75909L6.24189 13.7344C5.9603 14.2514 5.73591 14.6936 5.56432 15.0632C5.37952 15.4658 5.15073 16.0202 4.87794 16.7352L0.924679 18.4292C0.3307 18.6822 -0.0366898 19.2762 0.00291061 19.912L0.293301 24.4769C0.313148 24.7735 0.419628 25.0577 0.599522 25.2943C0.779415 25.5309 1.02481 25.7095 1.30527 25.8079L5.04954 27.1389C5.15733 27.6559 5.26953 28.0981 5.38832 28.4721C5.57993 29.0497 5.79871 29.6179 6.0439 30.1748L4.16297 34.3328C4.03021 34.6249 3.99447 34.9519 4.06098 35.2658C4.12748 35.5798 4.29274 35.8642 4.53255 36.0774L8.10963 39.2717C8.34521 39.4812 8.63917 39.6137 8.95214 39.6514C9.26511 39.6892 9.58215 39.6304 9.86077 39.4829L13.5478 37.5294C14.1247 37.8348 14.7198 38.1044 15.3298 38.3367L16.9401 38.9395L18.3701 42.8995C18.476 43.1895 18.6672 43.4407 18.9185 43.6201C19.1697 43.7995 19.4693 43.8988 19.778 43.9049L23.9579 43.9995C24.2748 44.0078 24.5864 43.9177 24.85 43.7416C25.1135 43.5655 25.316 43.312 25.4296 43.0161L27.1148 38.5567C27.6897 38.3602 28.259 38.1475 28.8219 37.9187C29.2823 37.7195 29.7358 37.5045 30.1815 37.2742L34.3613 39.0605C34.6367 39.178 34.9404 39.2129 35.2353 39.161C35.5302 39.109 35.8036 38.9725 36.0223 38.7679L39.1154 35.8662C39.3456 35.6511 39.5025 35.369 39.5637 35.0599C39.6249 34.7508 39.5873 34.4302 39.4563 34.1436L37.659 30.2276C37.898 29.7638 38.1197 29.2912 38.3234 28.8109C38.5612 28.2229 38.7813 27.6279 38.9834 27.0267L42.9212 25.8277C43.2413 25.7309 43.5205 25.5312 43.7154 25.2595C43.9103 24.9878 44.0101 24.6593 43.9992 24.3251L43.8452 20.099C43.8342 19.8232 43.7481 19.5557 43.5961 19.3254C43.4441 19.0951 43.232 18.9107 42.9828 18.7922L38.8514 16.8078C38.66 16.106 38.4928 15.5604 38.3454 15.1622C38.1378 14.6304 37.9074 14.1078 37.6546 13.5958L39.4453 9.81189C39.5812 9.52453 39.6225 9.20148 39.5632 8.88919C39.5039 8.57689 39.3471 8.29145 39.1154 8.07391L36.0267 5.15674C35.8101 4.95252 35.5392 4.81522 35.2465 4.76136C34.9538 4.7075 34.6518 4.73938 34.3767 4.85315L30.2013 6.57792C29.7393 6.26993 29.3213 6.02133 28.9429 5.82113C28.4919 5.58134 27.8891 5.33054 27.1302 5.05994L25.6782 1.00979C25.5709 0.713386 25.3747 0.457337 25.1164 0.276609C24.8581 0.0958807 24.5503 -0.000717743 24.2351 4.01527e-06H19.6284ZM21.9472 15.4416C25.6144 15.4416 28.5865 18.3786 28.5865 22.0041C28.5865 25.6297 25.6144 28.5689 21.9472 28.5689C18.2821 28.5689 15.31 25.6297 15.31 22.0041C15.31 18.3786 18.2799 15.4416 21.9472 15.4416Z" />
              </svg>
              <p className="font-cairo font-medium">الإعدادات</p>
            </button>
          </li>
          {/* {الاشعارات} */}
          <li>
            <button className="w-full flex items-center justify-start  px-4 h-14 rounded-[15px] hover:bg-[#3bc9d327] text-[#6A6A6A] hover:text-[#3BCAD3] group">
              <svg
                className=" ml-7 mr-3 fill-[#6A6A6A] group-hover:fill-[#3BCAD3]"
                width="24"
                height="24"
                viewBox="0 0 39 39"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path d="M19.4999 3.25C22.5167 3.25 25.41 4.44843 27.5432 6.58166C29.6765 8.71489 30.8749 11.6082 30.8749 14.625V20.358C30.8747 20.6101 30.9331 20.8588 31.0455 21.0844L33.8356 26.663C33.9719 26.9355 34.0363 27.2384 34.0226 27.5428C34.0089 27.8472 33.9176 28.1431 33.7574 28.4023C33.5972 28.6615 33.3734 28.8755 33.1072 29.0238C32.841 29.1722 32.5414 29.25 32.2366 29.25H6.76315C6.45843 29.25 6.15875 29.1722 5.89258 29.0238C5.62642 28.8755 5.4026 28.6615 5.24238 28.4023C5.08217 28.1431 4.99088 27.8472 4.97719 27.5428C4.9635 27.2384 5.02785 26.9355 5.16415 26.663L7.95265 21.0844C8.06565 20.8589 8.12463 20.6102 8.1249 20.358V14.625C8.1249 11.6082 9.32333 8.71489 11.4566 6.58166C13.5898 4.44843 16.4831 3.25 19.4999 3.25ZM19.4999 34.125C20.5084 34.1253 21.4922 33.8129 22.3158 33.2309C23.1394 32.6488 23.7623 31.8257 24.0986 30.875H14.9011C15.2375 31.8257 15.8604 32.6488 16.684 33.2309C17.5076 33.8129 18.4914 34.1253 19.4999 34.125Z" />
              </svg>
              <p className="font-cairo font-medium">الاشعارات</p>
            </button>
          </li>
        </ul>
      </div>

      {/* {الخروج} */}
      <div className="mb-14">
        <button
          onClick={handleSignOut}
          className="w-full flex items-center justify-start px-4 h-14 rounded-[15px] text-[#6A6A6A] hover:bg-[#FFEBEB] hover:text-[#6A6A6A] group font-cairo font-medium"
        >
          <img
            src={signoutlogo}
            alt="Icon 4"
            className="ml-6 mr-4 w-6 h-6 transition-colors duration-200"
          />
          الخروج
          {/* <p className="font-cairo font-medium">تسجيل الخروج</p> */}
        </button>
      </div>
    </div>
  );
};

export default SideNav;
